code-review/NRB_3471_3546/База_Было/Documents/ВводДивидендов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВводДивидендов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДивидендыИКупоны</xr:Item>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИПД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФиксации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежногоПоручения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежногоПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерИПД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий250</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаИПД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаДивиденды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Депонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДЕПО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Выплата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ВидыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыпискаОСостоянииСчетаДЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОбОперацияхПоСчетуДЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводныйОтчетОСовершеннойОперации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/Выписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Выписка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.иц_СводноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МХУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЦБ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеОтчетаВыписки</v8:Type>
						<v8:Type>cfg:DocumentRef.ГлобальнаяОперация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЦБВПути</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеНКД</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеквизитовСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАнкетныхДанных</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацииЦБ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПредставителяСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБПолное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦБЧастичное</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ФормированиеРеестраВладельцев</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСчетаДепо</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаПоручения</v8:Type>
						<v8:Type>cfg:DocumentRef.УчастиеВКД</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияЦБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭмитентУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправкиОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыПередачиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияВыпискиОперационныйДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБУведомление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБВыписка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопИнформация</Name>
					<Comment>Произвольный текст для вывода в соответствующее поля отчета о совершенной операции</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьДопИнформацию</Name>
					<Comment>Если требуется заблокировать автоматичсекое обновление поля, то следует установить этот флаг.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ВводДивидендов/Ext/ObjectModule.bsl
Функция ПолучитьРезультатЗапросаПоДивидендам(Ссылка, ВидДвижения)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ссылка										КАК Ссылка,
	|	Ссылка.Дата									КАК Период,
	|	Ссылка.ЦеннаяБумага 						КАК ЦеннаяБумага,
	|	Депонент									КАК Депонент,
	|	Количество									КАК Количество,
	|	Сумма										КАК Сумма,
	|	Ссылка.ЦеннаяБумага.ВалютаНоминала			КАК ВалютаНоминала,
	|	Ссылка.БанковскийСчет						КАК БанковскийСчет,
	|	&ВидДвижения								КАК ВидДвижения,
	|	Ссылка.БанковскийСчет.ВалютаДенежныхСредств КАК Валюта
	|ИЗ
	|	Документ.ВводДивидендов.ТаблицаДивиденды
	|ГДЕ
	|	Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвижения);
	
	Возврат Запрос.Выполнить();

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Изменяем задолженность по дивидендам
	РезультатЗапроса = ПолучитьРезультатЗапросаПоДивидендам(Ссылка, ВидДвиженияНакопления.Расход);
	Записи = РезультатЗапроса.Выгрузить();
	Движения.ДивидендыИКупоны.Загрузить(Записи);
	
	// Изменяем остатки по ДС
	РезультатЗапроса = ПолучитьРезультатЗапросаПоДивидендам(Ссылка, ВидДвиженияНакопления.Приход);
	Записи = РезультатЗапроса.Выгрузить();
	Движения.ДенежныеСредства.Загрузить(Записи);
	
	СформироватьВыписки();
		
КонецПроцедуры

Процедура СформироватьВыписки()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Дивиденды.ЦеннаяБумага				КАК ЦеннаяБумага,
	|	Дивиденды.ЦеннаяБумага.Эмитент		КАК Эмитент,
	|	Дивиденды.Депонент					КАК Депонент,
	|	Дивиденды.Количество				КАК Количество,
	|	Дивиденды.Сумма						КАК Сумма,
	|	Выписка.Ссылка						КАК Выписка,
	|	Дивиденды.СчетДепо					КАК СчетДепо,
	|	Дивиденды.Ссылка.ДокументОснование	КАК ДокументОснование
	|ИЗ
	|	Документ.ВводДивидендов.ТаблицаДивиденды КАК Дивиденды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Выписка КАК Выписка
	|		ПО Дивиденды.Ссылка = Выписка.ОперацияЦБ
	|			И Дивиденды.Депонент = Выписка.ВладелецСчета
	|			И Дивиденды.СчетДепо = Выписка.СчетДепо
	|ГДЕ
	|	Дивиденды.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Выписка) Тогда
			ВыпискаОбъект = Выборка.Выписка.ПолучитьОбъект();
		Иначе
			ВыпискаОбъект = Документы.Выписка.СоздатьДокумент();
			ВыпискаОбъект.Дата = Дата;
		КонецЕсли;
		
		ВыпискаОбъект.ВидОтчета			= Перечисления.ВидыОтчетов.Отчет;
		ВыпискаОбъект.ОперацияЦБ		= Ссылка;
		ВыпискаОбъект.ДокументОснование = Выборка.ДокументОснование;
		ВыпискаОбъект.ВладелецСчета		= Выборка.Депонент;
		ВыпискаОбъект.ЭмитентВыписка	= Выборка.Эмитент;
		ВыпискаОбъект.СчетДепо			= Выборка.СчетДепо;	// Почему раньше не заполнялось???!!? А в запросе JOIN есть
		
		ВыпискаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаДивиденды.Количество() = 0 Тогда
		Сообщить("Не выбрано ни одного депонента");  
		Отказ = Истина;			
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(СуммаИПД) Тогда
		Сообщить("Не указана сумма ИПД");  
		Отказ = Истина;			
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ЦеннаяБумага) Тогда
		Сообщить("Не выбрана ценная бумага");  
		Отказ = Истина;			
	КонецЕсли;	
	
	УстановитьНовыйНомер();
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание) Экспорт
	
	Если Основание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Если ПроверкаНаСозданныеДокументыНаОснованииТекущего(Основание) Тогда
	//	
	//	Проверка = Истина;
	//	Сообщить("На основании данного поручения уже есть введенный документ!!!");
	//	Возврат;
	//	
	//КонецЕсли;
	
	Если Основание.ВидОперацииД = Справочники.ВидыОпераций.НачислениеДивидендов Тогда 
		
		Дата				= ОбщегоНазначения.ДатаДокумента(Основание);
		ДатаЗакрытияРеестра	= ОбщегоНазначения.ДатаДокумента(Основание);
		Инициатор			= Основание.Инициатор;
		ДокументОснование 	= Основание.Ссылка;			
		Комментарий			= "Поручение № " + Основание.Номер + " от " + Основание.Дата;
		ЦеннаяБумага		= Основание.ЦБ;
		
	Иначе
			
		Проверка = Истина;
		ДокументОснование 	= Документы.Поручение.ПустаяСсылка();			
		Сообщить("На основании данного вида поручения нельзя создать документ ""Ввод дивидендов"". 
				  |Вид операции должен быть ""НачислениеДивидендов""!");
		Возврат;	
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	СтандартнаяОбработка = Ложь;
	
	Префикс = НумераторыОбъектов.ПолучитьПрефиксНомера(ЭтотОбъект);
	
	Номер = НумераторыОбъектов.ПолучитьНомерДокумента(ЭтотОбъект, Префикс);
	
КонецПроцедуры

#Если Клиент Тогда
	
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	СтруктураПечатныхФорм = Новый Структура;
	Возврат СтруктураПечатныхФорм;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
КонецПроцедуры

#КонецЕсли
